/* automatically generated by rust-bindgen 0.60.1 */

#![allow(nonstandard_style)]

pub const LIB3MF_VERSION_MAJOR: u32 = 2;
pub const LIB3MF_VERSION_MINOR: u32 = 2;
pub const LIB3MF_VERSION_MICRO: u32 = 0;
pub const LIB3MF_VERSION_PRERELEASEINFO: &[u8; 1usize] = b"\0";
pub const LIB3MF_VERSION_BUILDINFO: &[u8; 1usize] = b"\0";
pub const LIB3MF_SUCCESS: u32 = 0;
pub const LIB3MF_ERROR_NOTIMPLEMENTED: u32 = 1;
pub const LIB3MF_ERROR_INVALIDPARAM: u32 = 2;
pub const LIB3MF_ERROR_INVALIDCAST: u32 = 3;
pub const LIB3MF_ERROR_BUFFERTOOSMALL: u32 = 4;
pub const LIB3MF_ERROR_GENERICEXCEPTION: u32 = 5;
pub const LIB3MF_ERROR_COULDNOTLOADLIBRARY: u32 = 6;
pub const LIB3MF_ERROR_COULDNOTFINDLIBRARYEXPORT: u32 = 7;
pub const LIB3MF_ERROR_INCOMPATIBLEBINARYVERSION: u32 = 8;
pub const LIB3MF_ERROR_CALCULATIONABORTED: u32 = 10;
pub const LIB3MF_ERROR_SHOULDNOTBECALLED: u32 = 11;
pub const LIB3MF_ERROR_READERCLASSUNKNOWN: u32 = 100;
pub const LIB3MF_ERROR_WRITERCLASSUNKNOWN: u32 = 101;
pub const LIB3MF_ERROR_ITERATORINVALIDINDEX: u32 = 102;
pub const LIB3MF_ERROR_INVALIDMODELRESOURCE: u32 = 103;
pub const LIB3MF_ERROR_RESOURCENOTFOUND: u32 = 104;
pub const LIB3MF_ERROR_INVALIDMODEL: u32 = 105;
pub const LIB3MF_ERROR_INVALIDOBJECT: u32 = 106;
pub const LIB3MF_ERROR_INVALIDMESHOBJECT: u32 = 107;
pub const LIB3MF_ERROR_INVALIDCOMPONENTSOBJECT: u32 = 108;
pub const LIB3MF_ERROR_INVALIDCOMPONENT: u32 = 109;
pub const LIB3MF_ERROR_INVALIDBUILDITEM: u32 = 110;

pub const eLib3MFProgressIdentifier_eProgressIdentifierCREATEOPCPACKAGE: eLib3MFProgressIdentifier =
    13;
pub const eLib3MFProgressIdentifier_eProgressIdentifierWRITEMODELSTOSTREAM:
    eLib3MFProgressIdentifier = 14;
pub const eLib3MFProgressIdentifier_eProgressIdentifierWRITEROOTMODEL: eLib3MFProgressIdentifier =
    15;
pub const eLib3MFProgressIdentifier_eProgressIdentifierWRITENONROOTMODELS:
    eLib3MFProgressIdentifier = 16;
pub const eLib3MFProgressIdentifier_eProgressIdentifierWRITEATTACHMENTS: eLib3MFProgressIdentifier =
    17;
pub const eLib3MFProgressIdentifier_eProgressIdentifierWRITECONTENTTYPES:
    eLib3MFProgressIdentifier = 18;
pub const eLib3MFProgressIdentifier_eProgressIdentifierWRITENOBJECTS: eLib3MFProgressIdentifier =
    19;
pub const eLib3MFProgressIdentifier_eProgressIdentifierWRITENODES: eLib3MFProgressIdentifier = 20;
pub const eLib3MFProgressIdentifier_eProgressIdentifierWRITETRIANGLES: eLib3MFProgressIdentifier =
    21;
pub const eLib3MFProgressIdentifier_eProgressIdentifierWRITESLICES: eLib3MFProgressIdentifier = 22;
pub const eLib3MFProgressIdentifier_eProgressIdentifierWRITEKEYSTORE: eLib3MFProgressIdentifier =
    23;
pub type eLib3MFProgressIdentifier = ::std::os::raw::c_uint;
pub const eLib3MFBlendMethod_eBlendMethodNoBlendMethod: eLib3MFBlendMethod = 0;
pub const eLib3MFBlendMethod_eBlendMethodMix: eLib3MFBlendMethod = 1;
pub const eLib3MFBlendMethod_eBlendMethodMultiply: eLib3MFBlendMethod = 2;
pub type eLib3MFBlendMethod = ::std::os::raw::c_uint;
pub const eLib3MFEncryptionAlgorithm_eEncryptionAlgorithmAES256_GCM: eLib3MFEncryptionAlgorithm = 1;
pub type eLib3MFEncryptionAlgorithm = ::std::os::raw::c_uint;
pub const eLib3MFWrappingAlgorithm_eWrappingAlgorithmRSA_OAEP: eLib3MFWrappingAlgorithm = 0;
pub type eLib3MFWrappingAlgorithm = ::std::os::raw::c_uint;
pub const eLib3MFMgfAlgorithm_eMgfAlgorithmMGF1_SHA1: eLib3MFMgfAlgorithm = 160;
pub const eLib3MFMgfAlgorithm_eMgfAlgorithmMGF1_SHA224: eLib3MFMgfAlgorithm = 224;
pub const eLib3MFMgfAlgorithm_eMgfAlgorithmMGF1_SHA256: eLib3MFMgfAlgorithm = 256;
pub const eLib3MFMgfAlgorithm_eMgfAlgorithmMGF1_SHA384: eLib3MFMgfAlgorithm = 384;
pub const eLib3MFMgfAlgorithm_eMgfAlgorithmMGF1_SHA512: eLib3MFMgfAlgorithm = 512;
pub type eLib3MFMgfAlgorithm = ::std::os::raw::c_uint;
pub const eLib3MFDigestMethod_eDigestMethodSHA1: eLib3MFDigestMethod = 160;
pub const eLib3MFDigestMethod_eDigestMethodSHA256: eLib3MFDigestMethod = 256;
pub type eLib3MFDigestMethod = ::std::os::raw::c_uint;
pub const eLib3MFCompression_eCompressionNoCompression: eLib3MFCompression = 0;
pub const eLib3MFCompression_eCompressionDeflate: eLib3MFCompression = 1;
pub type eLib3MFCompression = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Copy, Clone)]
pub union structEnumLib3MFBeamLatticeCapMode {
    pub m_enum: eLib3MFBeamLatticeCapMode,
    pub m_code: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_structEnumLib3MFBeamLatticeCapMode() {
    assert_eq!(
        ::std::mem::size_of::<structEnumLib3MFBeamLatticeCapMode>(),
        4usize,
        concat!("Size of: ", stringify!(structEnumLib3MFBeamLatticeCapMode))
    );
    assert_eq!(
        ::std::mem::align_of::<structEnumLib3MFBeamLatticeCapMode>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(structEnumLib3MFBeamLatticeCapMode)
        )
    );
    fn test_field_m_enum() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<structEnumLib3MFBeamLatticeCapMode>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).m_enum) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(structEnumLib3MFBeamLatticeCapMode),
                "::",
                stringify!(m_enum)
            )
        );
    }
    test_field_m_enum();
    fn test_field_m_code() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<structEnumLib3MFBeamLatticeCapMode>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).m_code) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(structEnumLib3MFBeamLatticeCapMode),
                "::",
                stringify!(m_code)
            )
        );
    }
    test_field_m_code();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union structEnumLib3MFBlendMethod {
    pub m_enum: eLib3MFBlendMethod,
    pub m_code: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_structEnumLib3MFBlendMethod() {
    assert_eq!(
        ::std::mem::size_of::<structEnumLib3MFBlendMethod>(),
        4usize,
        concat!("Size of: ", stringify!(structEnumLib3MFBlendMethod))
    );
    assert_eq!(
        ::std::mem::align_of::<structEnumLib3MFBlendMethod>(),
        4usize,
        concat!("Alignment of ", stringify!(structEnumLib3MFBlendMethod))
    );
    fn test_field_m_enum() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<structEnumLib3MFBlendMethod>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).m_enum) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(structEnumLib3MFBlendMethod),
                "::",
                stringify!(m_enum)
            )
        );
    }
    test_field_m_enum();
    fn test_field_m_code() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<structEnumLib3MFBlendMethod>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).m_code) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(structEnumLib3MFBlendMethod),
                "::",
                stringify!(m_code)
            )
        );
    }
    test_field_m_code();
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct sLib3MFTriangle {
    pub m_Indices: [Lib3MF_uint32; 3usize],
}
#[test]
fn bindgen_test_layout_sLib3MFTriangle() {
    assert_eq!(
        ::std::mem::size_of::<sLib3MFTriangle>(),
        12usize,
        concat!("Size of: ", stringify!(sLib3MFTriangle))
    );
    assert_eq!(
        ::std::mem::align_of::<sLib3MFTriangle>(),
        1usize,
        concat!("Alignment of ", stringify!(sLib3MFTriangle))
    );
    fn test_field_m_Indices() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<sLib3MFTriangle>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).m_Indices) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(sLib3MFTriangle),
                "::",
                stringify!(m_Indices)
            )
        );
    }
    test_field_m_Indices();
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct sLib3MFTriangleProperties {
    pub m_ResourceID: Lib3MF_uint32,
    pub m_PropertyIDs: [Lib3MF_uint32; 3usize],
}
#[test]
fn bindgen_test_layout_sLib3MFTriangleProperties() {
    assert_eq!(
        ::std::mem::size_of::<sLib3MFTriangleProperties>(),
        16usize,
        concat!("Size of: ", stringify!(sLib3MFTriangleProperties))
    );
    assert_eq!(
        ::std::mem::align_of::<sLib3MFTriangleProperties>(),
        1usize,
        concat!("Alignment of ", stringify!(sLib3MFTriangleProperties))
    );
    fn test_field_m_ResourceID() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<sLib3MFTriangleProperties>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).m_ResourceID) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(sLib3MFTriangleProperties),
                "::",
                stringify!(m_ResourceID)
            )
        );
    }
    test_field_m_ResourceID();
    fn test_field_m_PropertyIDs() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<sLib3MFTriangleProperties>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).m_PropertyIDs) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(sLib3MFTriangleProperties),
                "::",
                stringify!(m_PropertyIDs)
            )
        );
    }
    test_field_m_PropertyIDs();
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct sLib3MFPosition {
    pub m_Coordinates: [Lib3MF_single; 3usize],
}
#[test]
fn bindgen_test_layout_sLib3MFPosition() {
    assert_eq!(
        ::std::mem::size_of::<sLib3MFPosition>(),
        12usize,
        concat!("Size of: ", stringify!(sLib3MFPosition))
    );
    assert_eq!(
        ::std::mem::align_of::<sLib3MFPosition>(),
        1usize,
        concat!("Alignment of ", stringify!(sLib3MFPosition))
    );
    fn test_field_m_Coordinates() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<sLib3MFPosition>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).m_Coordinates) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(sLib3MFPosition),
                "::",
                stringify!(m_Coordinates)
            )
        );
    }
    test_field_m_Coordinates();
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct sLib3MFPosition2D {
    pub m_Coordinates: [Lib3MF_single; 2usize],
}
#[test]
fn bindgen_test_layout_sLib3MFPosition2D() {
    assert_eq!(
        ::std::mem::size_of::<sLib3MFPosition2D>(),
        8usize,
        concat!("Size of: ", stringify!(sLib3MFPosition2D))
    );
    assert_eq!(
        ::std::mem::align_of::<sLib3MFPosition2D>(),
        1usize,
        concat!("Alignment of ", stringify!(sLib3MFPosition2D))
    );
    fn test_field_m_Coordinates() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<sLib3MFPosition2D>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).m_Coordinates) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(sLib3MFPosition2D),
                "::",
                stringify!(m_Coordinates)
            )
        );
    }
    test_field_m_Coordinates();
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct sLib3MFCompositeConstituent {
    pub m_PropertyID: Lib3MF_uint32,
    pub m_MixingRatio: Lib3MF_double,
}
#[test]
fn bindgen_test_layout_sLib3MFCompositeConstituent() {
    assert_eq!(
        ::std::mem::size_of::<sLib3MFCompositeConstituent>(),
        12usize,
        concat!("Size of: ", stringify!(sLib3MFCompositeConstituent))
    );
    assert_eq!(
        ::std::mem::align_of::<sLib3MFCompositeConstituent>(),
        1usize,
        concat!("Alignment of ", stringify!(sLib3MFCompositeConstituent))
    );
    fn test_field_m_PropertyID() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<sLib3MFCompositeConstituent>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).m_PropertyID) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(sLib3MFCompositeConstituent),
                "::",
                stringify!(m_PropertyID)
            )
        );
    }
    test_field_m_PropertyID();
    fn test_field_m_MixingRatio() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<sLib3MFCompositeConstituent>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).m_MixingRatio) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(sLib3MFCompositeConstituent),
                "::",
                stringify!(m_MixingRatio)
            )
        );
    }
    test_field_m_MixingRatio();
}
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct sLib3MFMultiPropertyLayer {
    pub m_ResourceID: Lib3MF_uint32,
    pub m_TheBlendMethod: structEnumLib3MFBlendMethod,
}
#[test]
fn bindgen_test_layout_sLib3MFMultiPropertyLayer() {
    assert_eq!(
        ::std::mem::size_of::<sLib3MFMultiPropertyLayer>(),
        8usize,
        concat!("Size of: ", stringify!(sLib3MFMultiPropertyLayer))
    );
    assert_eq!(
        ::std::mem::align_of::<sLib3MFMultiPropertyLayer>(),
        1usize,
        concat!("Alignment of ", stringify!(sLib3MFMultiPropertyLayer))
    );
    fn test_field_m_ResourceID() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<sLib3MFMultiPropertyLayer>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).m_ResourceID) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(sLib3MFMultiPropertyLayer),
                "::",
                stringify!(m_ResourceID)
            )
        );
    }
    test_field_m_ResourceID();
    fn test_field_m_TheBlendMethod() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<sLib3MFMultiPropertyLayer>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).m_TheBlendMethod) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(sLib3MFMultiPropertyLayer),
                "::",
                stringify!(m_TheBlendMethod)
            )
        );
    }
    test_field_m_TheBlendMethod();
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct sLib3MFTex2Coord {
    pub m_U: Lib3MF_double,
    pub m_V: Lib3MF_double,
}
#[test]
fn bindgen_test_layout_sLib3MFTex2Coord() {
    assert_eq!(
        ::std::mem::size_of::<sLib3MFTex2Coord>(),
        16usize,
        concat!("Size of: ", stringify!(sLib3MFTex2Coord))
    );
    assert_eq!(
        ::std::mem::align_of::<sLib3MFTex2Coord>(),
        1usize,
        concat!("Alignment of ", stringify!(sLib3MFTex2Coord))
    );
    fn test_field_m_U() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<sLib3MFTex2Coord>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).m_U) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(sLib3MFTex2Coord),
                "::",
                stringify!(m_U)
            )
        );
    }
    test_field_m_U();
    fn test_field_m_V() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<sLib3MFTex2Coord>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).m_V) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(sLib3MFTex2Coord),
                "::",
                stringify!(m_V)
            )
        );
    }
    test_field_m_V();
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct sLib3MFTransform {
    pub m_Fields: [[Lib3MF_single; 3usize]; 4usize],
}
#[test]
fn bindgen_test_layout_sLib3MFTransform() {
    assert_eq!(
        ::std::mem::size_of::<sLib3MFTransform>(),
        48usize,
        concat!("Size of: ", stringify!(sLib3MFTransform))
    );
    assert_eq!(
        ::std::mem::align_of::<sLib3MFTransform>(),
        1usize,
        concat!("Alignment of ", stringify!(sLib3MFTransform))
    );
    fn test_field_m_Fields() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<sLib3MFTransform>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).m_Fields) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(sLib3MFTransform),
                "::",
                stringify!(m_Fields)
            )
        );
    }
    test_field_m_Fields();
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct sLib3MFBox {
    pub m_MinCoordinate: [Lib3MF_single; 3usize],
    pub m_MaxCoordinate: [Lib3MF_single; 3usize],
}
#[test]
fn bindgen_test_layout_sLib3MFBox() {
    assert_eq!(
        ::std::mem::size_of::<sLib3MFBox>(),
        24usize,
        concat!("Size of: ", stringify!(sLib3MFBox))
    );
    assert_eq!(
        ::std::mem::align_of::<sLib3MFBox>(),
        1usize,
        concat!("Alignment of ", stringify!(sLib3MFBox))
    );
    fn test_field_m_MinCoordinate() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<sLib3MFBox>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).m_MinCoordinate) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(sLib3MFBox),
                "::",
                stringify!(m_MinCoordinate)
            )
        );
    }
    test_field_m_MinCoordinate();
    fn test_field_m_MaxCoordinate() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<sLib3MFBox>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).m_MaxCoordinate) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(sLib3MFBox),
                "::",
                stringify!(m_MaxCoordinate)
            )
        );
    }
    test_field_m_MaxCoordinate();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sLib3MFColor {
    pub m_Red: Lib3MF_uint8,
    pub m_Green: Lib3MF_uint8,
    pub m_Blue: Lib3MF_uint8,
    pub m_Alpha: Lib3MF_uint8,
}
#[test]
fn bindgen_test_layout_sLib3MFColor() {
    assert_eq!(
        ::std::mem::size_of::<sLib3MFColor>(),
        4usize,
        concat!("Size of: ", stringify!(sLib3MFColor))
    );
    assert_eq!(
        ::std::mem::align_of::<sLib3MFColor>(),
        1usize,
        concat!("Alignment of ", stringify!(sLib3MFColor))
    );
    fn test_field_m_Red() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<sLib3MFColor>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).m_Red) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(sLib3MFColor),
                "::",
                stringify!(m_Red)
            )
        );
    }
    test_field_m_Red();
    fn test_field_m_Green() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<sLib3MFColor>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).m_Green) as usize - ptr as usize
            },
            1usize,
            concat!(
                "Offset of field: ",
                stringify!(sLib3MFColor),
                "::",
                stringify!(m_Green)
            )
        );
    }
    test_field_m_Green();
    fn test_field_m_Blue() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<sLib3MFColor>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).m_Blue) as usize - ptr as usize
            },
            2usize,
            concat!(
                "Offset of field: ",
                stringify!(sLib3MFColor),
                "::",
                stringify!(m_Blue)
            )
        );
    }
    test_field_m_Blue();
    fn test_field_m_Alpha() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<sLib3MFColor>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).m_Alpha) as usize - ptr as usize
            },
            3usize,
            concat!(
                "Offset of field: ",
                stringify!(sLib3MFColor),
                "::",
                stringify!(m_Alpha)
            )
        );
    }
    test_field_m_Alpha();
}
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct sLib3MFBeam {
    pub m_Indices: [Lib3MF_uint32; 2usize],
    pub m_Radii: [Lib3MF_double; 2usize],
    pub m_CapModes: [structEnumLib3MFBeamLatticeCapMode; 2usize],
}
#[test]
fn bindgen_test_layout_sLib3MFBeam() {
    assert_eq!(
        ::std::mem::size_of::<sLib3MFBeam>(),
        32usize,
        concat!("Size of: ", stringify!(sLib3MFBeam))
    );
    assert_eq!(
        ::std::mem::align_of::<sLib3MFBeam>(),
        1usize,
        concat!("Alignment of ", stringify!(sLib3MFBeam))
    );
    fn test_field_m_Indices() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<sLib3MFBeam>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).m_Indices) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(sLib3MFBeam),
                "::",
                stringify!(m_Indices)
            )
        );
    }
    test_field_m_Indices();
    fn test_field_m_Radii() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<sLib3MFBeam>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).m_Radii) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(sLib3MFBeam),
                "::",
                stringify!(m_Radii)
            )
        );
    }
    test_field_m_Radii();
    fn test_field_m_CapModes() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<sLib3MFBeam>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).m_CapModes) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(sLib3MFBeam),
                "::",
                stringify!(m_CapModes)
            )
        );
    }
    test_field_m_CapModes();
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct sLib3MFBall {
    pub m_Index: Lib3MF_uint32,
    pub m_Radius: Lib3MF_double,
}
#[test]
fn bindgen_test_layout_sLib3MFBall() {
    assert_eq!(
        ::std::mem::size_of::<sLib3MFBall>(),
        12usize,
        concat!("Size of: ", stringify!(sLib3MFBall))
    );
    assert_eq!(
        ::std::mem::align_of::<sLib3MFBall>(),
        1usize,
        concat!("Alignment of ", stringify!(sLib3MFBall))
    );
    fn test_field_m_Index() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<sLib3MFBall>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).m_Index) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(sLib3MFBall),
                "::",
                stringify!(m_Index)
            )
        );
    }
    test_field_m_Index();
    fn test_field_m_Radius() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<sLib3MFBall>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).m_Radius) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(sLib3MFBall),
                "::",
                stringify!(m_Radius)
            )
        );
    }
    test_field_m_Radius();
}
#[doc = " Lib3MFProgressCallback - A callback function"]
#[doc = ""]
#[doc = " @param[out] pAbort - Returns whether the calculation should be aborted"]
#[doc = " @param[in] dProgressValue - The value of the progress function: values in the interval [0,1] are progress; < mean no progress update"]
#[doc = " @param[in] eProgressIdentifier - An identifier of progress"]
#[doc = " @param[in] pUserData - Userdata that is passed to the callback function"]
pub type Lib3MFProgressCallback = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *mut bool,
        arg2: Lib3MF_double,
        arg3: eLib3MFProgressIdentifier,
        arg4: Lib3MF_pvoid,
    ),
>;
#[doc = " Lib3MFWriteCallback - Callback to call for writing a data chunk"]
#[doc = ""]
